testsuite/sysbench/results/oltp_read_only.lua_threads64/run.perf.log
sysbench 1.1.0 (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 64
Warmup time: 10s
Report intermediate results every 20 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

Warming up for 10 seconds...

[ 20s ] thds: 64 tps: 3637.15 qps: 58214.13 (r/w/o: 50937.80/0.00/7276.33) lat (ms,95%): 17.95 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 64 tps: 3730.20 qps: 59685.61 (r/w/o: 52225.05/0.00/7460.56) lat (ms,95%): 21.89 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 64 tps: 3719.85 qps: 59515.86 (r/w/o: 52076.56/0.00/7439.30) lat (ms,95%): 21.89 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            3114405
        write:                           0
        other:                           444925
        total:                           3559330
    transactions:                        222494 (3707.30 per sec.)
    queries:                             3559330 (59307.30 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      3707.3038
    time elapsed:                        60.0152s
    total number of events:              222494

Latency (ms):
         min:                                    3.66
         avg:                                   17.26
         max:                                   40.94
         95th percentile:                       21.11
         sum:                              3840086.37

Threads fairness:
    events (avg/stddev):           3476.4062/19.16
    execution time (avg/stddev):   60.0013/0.01

sysbench 1.1.0 (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 64
Warmup time: 10s
Report intermediate results every 20 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

Warming up for 10 seconds...

[ 20s ] thds: 64 tps: 3915.07 qps: 62661.84 (r/w/o: 54829.62/0.00/7832.21) lat (ms,95%): 20.74 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 64 tps: 3932.31 qps: 62918.05 (r/w/o: 55053.39/0.00/7864.66) lat (ms,95%): 20.37 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 64 tps: 3971.30 qps: 63539.83 (r/w/o: 55597.64/0.00/7942.19) lat (ms,95%): 22.28 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            3315768
        write:                           0
        other:                           473702
        total:                           3789470
    transactions:                        236881 (3947.13 per sec.)
    queries:                             3789470 (63143.64 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      3947.1296
    time elapsed:                        60.0137s
    total number of events:              236881

Latency (ms):
         min:                                    3.37
         avg:                                   16.21
         max:                                   42.48
         95th percentile:                       21.50
         sum:                              3840015.37

Threads fairness:
    events (avg/stddev):           3701.1719/187.89
    execution time (avg/stddev):   60.0002/0.01